Performance/Results/2026-09-17-stream-controls/3-vapor-batched-stream-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/stream
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.39ms  302.81us   8.13ms   79.92%
    Req/Sec     3.65k   101.41     3.87k    66.67%
  Latency Distribution
     50%    4.35ms
     75%    4.53ms
     90%    4.75ms
     99%    5.30ms
  74146 requests in 5.10s, 1.13GB read
Requests/sec:  14536.51
Transfer/sec:    227.72MB

METRICS {"requests":74146,"duration_us":5100675,"bytes":1217937724,"p50_us":4349,"p99_us":5299,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}