Performance/Results/2026-09-17-stream-controls/3-vapor-stream-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/stream
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.33ms  370.16us  10.49ms   85.16%
    Req/Sec     3.71k    78.12     3.92k    68.63%
  Latency Distribution
     50%    4.30ms
     75%    4.46ms
     90%    4.69ms
     99%    5.31ms
  75281 requests in 5.10s, 1.15GB read
Requests/sec:  14759.41
Transfer/sec:    231.21MB

METRICS {"requests":75281,"duration_us":5100543,"bytes":1236607900,"p50_us":4300,"p99_us":5308,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}